Tekla.Structures.Filtering.Filter
The Filter class creates a filter file based on the input Tekla.Structures.Filtering.Filter.FilterExpression object.
Tekla.Structures.Filtering.BinaryFilterExpression
Tekla.Structures.Filtering.BinaryFilterExpressionCollection
The following example creates a Tekla Structures object group selection filter file.
The expression generated is the following:
(PartName == BEAM1 OR PartName == BEAM2 OR PartName == BEAM3 OR PartComment StartsWith test)
using System;
using System.IO;
using Tekla.Structures.Filtering;
using Tekla.Structures.Filtering.Categories;
public class FilterExample
{
// Creates a selection filter for the following filter expression:
// (PartName == BEAM1 OR PartName == BEAM2 OR PartName == BEAM3 OR PartComment StartsWith test)
public void CreateSelectionFilter()
{
// Creates the filter expressions
PartFilterExpressions.Name PartName = new PartFilterExpressions.Name();
StringConstantFilterExpression Beam1 = new StringConstantFilterExpression("BEAM1");
StringConstantFilterExpression Beam2 = new StringConstantFilterExpression("BEAM2");
StringConstantFilterExpression Beam3 = new StringConstantFilterExpression("BEAM3");
// Creates a custom part filter
PartFilterExpressions.CustomString PartComment = new PartFilterExpressions.CustomString("Comment");
StringConstantFilterExpression Test = new StringConstantFilterExpression("test");
// Creates the binary filter expressions
BinaryFilterExpression Expression1 = new BinaryFilterExpression(PartName, StringOperatorType.IS_EQUAL, Beam1);
BinaryFilterExpression Expression2 = new BinaryFilterExpression(PartName, StringOperatorType.IS_EQUAL, Beam2);
BinaryFilterExpression Expression3 = new BinaryFilterExpression(PartName, StringOperatorType.IS_EQUAL, Beam3);
BinaryFilterExpression Expression4 = new BinaryFilterExpression(PartComment, StringOperatorType.STARTS_WITH, Test);
// Creates the binary filter expression collection
BinaryFilterExpressionCollection ExpressionCollection = new BinaryFilterExpressionCollection();
ExpressionCollection.Add(new BinaryFilterExpressionItem(Expression1, BinaryFilterOperatorType.BOOLEAN_OR));
ExpressionCollection.Add(new BinaryFilterExpressionItem(Expression2, BinaryFilterOperatorType.BOOLEAN_OR));
ExpressionCollection.Add(new BinaryFilterExpressionItem(Expression3, BinaryFilterOperatorType.BOOLEAN_OR));
ExpressionCollection.Add(new BinaryFilterExpressionItem(Expression4));
string AttributesPath = Path.Combine(@"c:\modelPath", "attributes");
string FilterName = Path.Combine(AttributesPath, "filter");
Filter Filter = new Filter(ExpressionCollection);
// Generates the filter file
Filter.CreateFile(FilterExpressionFileType.OBJECT_GROUP_SELECTION, FilterName);
}
}

Tekla.Structures.Filtering.Filter.FilterExpression
Gets the current Tekla.Structures.Filtering.Filter.FilterExpression instance.
Throws System.NullReferenceException: Thrown when a null value is specified.

Tekla.Structures.Filtering.Filter.#ctor(Tekla.Structures.Filtering.FilterExpression)
Initializes a new instance of the Filter class.
FilterExpression: The Tekla.Structures.Filtering.Filter.FilterExpression object to be generated.
Throws System.ArgumentNullException: Thrown when a null FilterExpression is specified.

Tekla.Structures.Filtering.Filter.#ctor(System.String,System.IFormatProvider)
Initializes a new instance of the Filter class.
FullFileName: The filter's full file name to load.
Provider: An object that supports the System.IFormatProvider interface to correctly parse numbers
and dates according to the current culture information. If not provided, the current CultureInfo is used.
Throws System.ArgumentNullException: Thrown when a null FullFileName is specified.

Tekla.Structures.Filtering.Filter.CreateFile(Tekla.Structures.Filtering.FilterExpressionFileType,System.String)
Creates a filter and saves it as a text file.
FilterExpressionFileType: The Tekla.Structures.Filtering.FilterExpressionFileType to be generated.
FullFileName: The full file name of the file to be saved.
Returns: A string containing the filter's full file name.

Tekla.Structures.Filtering.Filter.ToString
Returns the current Tekla.Structures.Filtering.Filter.FilterExpression as a string.
Returns: A string representation of the current Tekla.Structures.Filtering.Filter.FilterExpression.